brew "dotnet"
brew "dotnet@6"
brew "git"
brew "glab"
brew "node"
cask "caffeine"
cask "discord"
cask "fork"
cask "gimp"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "notion"
cask "slack"
cask "spotify"
cask "stats"
cask "todoist-app"
cask "visual-studio-code"

# Programming #2
brew "awscli"
brew "composer"
brew "gcloud-cli"
brew "git"
brew "git-lfs"
brew "kotlin"
brew "npm"
brew "rbenv"
brew "sqlite"
brew "uv"
brew "vim"
brew "watchman"
brew "xcodes"
brew "yarn"

# AI Tools
brew "gemini-cli"
cask "cursor"
cask "claude"
brew "claude-squad"
brew "ollama"
cask "windsurf"

# Development Apps
cask "docker"
cask "figma"
cask "flutter"
cask "github"
cask "postman"
cask "proxyman"
cask "visual-studio-code"



vscode "ahmadawais.shades-of-purple"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "edinsonrequena.linux-ubuntu-theme"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.theme-ubuntu-style"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "grjuan.theme-ubuntu"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "patbenatar.advanced-new-file"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "thiagolciobittencourt.ubuntuvscode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
