# Brewfile for macOS package management

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"

# CLI Tools
brew "awscli"
brew "bash"
brew "curl"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "grep"
brew "pkg-config"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"

# Programming Languages
brew "dotnet"
brew "go"
brew "node"
brew "openjdk"
brew "php"
brew "python"
brew "rust"
brew "sqlite"

# Package Managers
brew "bun"
brew "composer"
brew "npm"
brew "uv"
brew "yarn"

# AI Tools
brew "claude-code"
brew "gemini-cli"
cask "claude"

# System Apps
cask "appcleaner"
cask "iterm2"
cask "keka"
cask "rectangle"
cask "stats"

# Development Apps
cask "docker"
cask "figma"
cask "jetbrains-toolbox"
cask "postman"
cask "visual-studio-code"

# Other Apps
cask "iina"
cask "slack"
cask "zoom"
